<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Unidad III</title>
    <link rel="stylesheet" href="styles.css">
    <link rel="icon" type="img/jpg" href="img/icono.png">
</head>

<body>
    <header class="header">
        <div class="logo">
            <p>ARQUITECTURA DE COMPUTADORAS</p>
        </div>
        <input type="checkbox" id="menu-bar">
        <label for="menu-bar">Menu</label>
        <nav>
            <ul class="nav-links">
                <li><a href="index.html">Inicio</a></li>
                <li><a href="u1.html">Unidad I</a></li>
                <li><a href="u2.html">Unidad II</a></li>
                <li><a href="u3.html">Unidad III</a></li>
                <li><a href="u4.html">Unidad IV</a></li>
                <li><a href="actPract.html">Pr&aacute;cticas</a></li>
            </ul>
        </nav>

    </header>

    <div class="msg-area1">
        <h2>Unidad III</h2>
        <h3>Selecci&oacute;n de computadoras para ensamble de equipo de computo </h3>
        <p style="padding-bottom: 5%;">Seleccionar una computadora no es f&aacute;cil. Puede ser un proceso confuso, por ello
            se debe contar con la informaci&oacute;n necesaria para tomar una decisi&oacute;n correcta, filtrar la b&uacute;squeda para
            descartar opciones de poco inter&eacute;s. Ciertos par&aacute;metros, como el rango de precios y para qu&eacute; y d&oacute;nde tienes
            pensado usar el dispositivo, ayudan a definir el equipo perfecto.
        </p>

        <hr color="red" size="10px" />
        <h4 style="padding-top: 2%; padding-bottom: 2%;"><em>3.1.- Chipset</em></h4>
        <hr color="red" size="10px" />
        <p style="padding-top: 4%;">Un <i>chipset</i> es un conjunto de componentes electr&oacute;nicos que gestionan el flujo
            de datos entre el procesador, la memoria, y los perif&eacute;ricos, por lo que desempe&ntilde;an un papel fundamental
            en el rendimiento y la funcionalidad de un ordenador o dispositivo m&oacute;vil, ya que determinan la velocidad y
            eficacia de la transferencia de datos entre componentes, as&iacute; como la calidad de la salida de gr&aacute;ficos y
            audio.
            Hay dos tipos principales de chipset.</p>

        <img src="img/Img3-1.png" style="height: 40%; width: 50%; padding-top: 5%; padding-bottom: 3%;">
        <ul style="margin-left: 3%; padding-bottom: 5%;">
            <li style="padding-top: 2%;"><strong>Chipset de la CPU</strong>:
                se encuentra en el propio procesador y se encarga de la comunicaci&oacute;n entre el procesador y la memoria.
            </li>
            <li style="padding-top: 2%;"><strong>Chipset de placa madre</strong>:
                se encuentra en la placa madre y se encarga de la comunicaci&oacute;n entre el procesador,
                la memoria y los perif&eacute;ricos.</li>
        </ul>

        <h5 style="padding-top: 5%;"><em>3.1.1- Unidad central De procesamiento (CPU)</em></h5>
        <p>El <b>CPU</b> es el componente fundamental de
            cualquier computadora. Es responsable de procesar y ejecutar instrucciones, as&iacute; como de controlar y
            coordinar el flujo de datos en la computadora, los criterios que determinan su finalidad son:
        </p>

        <ol style="margin-left: 3%;">
            <li value="1" style="padding-top: 2%;"><b>N&uacute;cleos</b>:
                Realizan lectura y ejecuci&oacute;n de instrucciones, aunque son instrucciones ordinarias, son paralelizadas
                en la ejecuci&oacute;n. Los multiprocesadores homog&eacute;neos tienen n&uacute;cleos id&eacute;nticos, y los heterog&eacute;neos tienen
                n&uacute;cleos distintos. Seg&uacute;n el dise&ntilde;o, pueden compartir cach&eacute; y memoria y por lo tanto ser mas rapidos.
            </li>

            <li style="padding-top: 2%;"><b>Cach&eacute;</b>:
                Considerando que la velocidad de los procesadores aumenta m&aacute;s r&aacute;pido que la velocidad de la memoria,
                la optimizaci&oacute;n del procesamiento mediante cach&eacute; evita el cuello de botella.
                El cach&eacute; disminuye la latencia y mejora el rendimiento del procesador.
            </li>

            <li style="padding-top: 2%;"><b>Frecuencia</b>:
                Es la velocidad a la cual el generador de reloj del procesador genera pulsos,
                los cuales son indicadores de la rapidez del procesador y sus operaciones.
                Aunque mayor frecuencia implica mayor velocidad de procesamiento, se deben tomar en cuenta
                la optimizaci&oacute;n de estos, ya sea por segmentaci&oacute;n de instrucciones como por n&uacute;cleos m&uacute;ltiples.
            </li>

            <li style="padding-top: 2%;"><b>Hilos</b>:
                Especifica el n&uacute;mero de procesos independientes que un CPU permite, y algunas tecnolog&iacute;as
                permiten que un solo n&uacute;cleo pueda tener 2 o m&aacute;s hilos.
            </li>

            <li style="padding-top: 2%;"><b>Overclocking</b>:
                Es la pr&aacute;ctica de sobrecargar la frecuencia del procesador (mediante mayores voltajes)
                a tasas mayores a las certificadas por el manufacturero para mayor rendimiento.
            </li>

            <li style="padding-top: 2%;"><b>Compatibilidad de z&oacute;calo</b>:
                Es el conector que enlaza el CPU a la tarjeta madre.
                Para que el CPU sea compatible con la tarjeta madre, debe ser compatible con el z&oacute;calo.
                Entre diferentes z&oacute;calos, mayor cantidad de pines aumentar&aacute; la velocidad de transmisi&oacute;n de las se&ntilde;ales.
            </li>

            <li style="padding-top: 2%;"><b>Compatibilidad de BIOS</b>:
                La BIOS es firmware, c&oacute;digo de bajo nivel que inicializa el hardware y el SO.
                Aunque un microprocesador en espec&iacute;fico sea compatible con la tarjeta madre en cuesti&oacute;n,
                esta necesita tener al menos la misma versi&oacute;n de la BIOS con la que el microprocesador es compatible.
            </li>
        </ol>

        <h5 style="padding-top: 5%;"><em>3.1.2- Controlador de bus</em></h5>

        <p>Un <b>controlador de bus</b> es un componente clave en la arquitectura de una computadora que se encarga de
            coordinar y gestionar la comunicaci&oacute;n entre los diferentes componentes de hardware que se conectan al bus.
            El controlador de bus establece protocolos de comunicaci&oacute;n, controla el flujo de datos, gestiona
            interrupciones y asigna recursos de hardware, asegurando que los diferentes componentes de hardware puedan
            comunicarse de manera efectiva y coordinada.
        </p>

        <p>La compatibilidad con el sistema operativo y los dispositivos conectados es crucial
            para garantizar un funcionamiento adecuado y sin errores.
        </p>

        <h5 style="padding-top: 5%;"><em>3.1.3- Puertos de entrada y salida</em></h5>
        <p>
            Los <b>puertos de entrada/salida</b> son interfaces que permiten la comunicaci&oacute;n entre
            dispositivos perif&eacute;ricos y la placa madre o chipset de un ordenador.
            Estos puertos pueden ser utilizados para conectar dispositivos
            externos, como teclados, ratones, impresoras, monitores, discos duros externos, entre otros.
        </p>
        <img src="img/Img3-2.png" style="height: 20%; width: 30%; padding-top: 0.4%; padding-bottom: 3%;">

        <p>Existen diferentes tipos de puertos de entrada/salida, cada uno con su propia funci&oacute;n y velocidad de
            transferencia de datos.
        </p>

        <p style="text-align: center; margin-top: 4%;">Puerto serial / RS-232</p>
        <img src="img/Img3-3.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p>Es el est&aacute;ndar com&uacute;n usado en los puertos serie. Define las propiedades el&eacute;ctricas y la sincronizaci&oacute;n de las
            se&ntilde;ales, as&iacute; como la interpretaci&oacute;n de las mismas, el tama&ntilde;o f&iacute;sico y la configuraci&oacute;n de los pines del
            conector. Se utiliza para conectar dispositivos de comunicaci&oacute;n serial, como m&oacute;dems y dispositivos de GPS.
        </p>

        <p style="text-align: center; margin-top: 4%;">Puerto paralelo / LPT</p>
        <img src="img/Img3-4.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Son puertos paralelos esos que permiten el intercambio simultaneo de paquetes de
            datos a trav&eacute;s de los diferentes hilos o cables, y en ambos sentidos. El nombre de puerto paralelo es debido
            a la forma en la que funciona todo a nivel f&iacute;sico, ya que hay un cable por cada bit que se env&iacute;a.
            Es utilizado para la conexi&oacute;n de impresoras, esc&aacute;neres y otros dispositivos.
        </p>

        <p style="text-align: center; margin-top: 4%;">Puerto VGA</p>
        <img src="img/Img3-5.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Es un est&aacute;ndar de conexi&oacute;n, utilizado para transferir se&ntilde;ales de
            v&iacute;deo desde un dispositivos como monitores y pantallas de ordenador
            a la tarjeta gr&aacute;fica de una computadora mediante se&ntilde;al anal&oacute;gica.
        </p>

        <p style="text-align: center; margin-top: 4%;">USB</p>
        <img src="img/Img3-6.png" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Es un puerto dise&ntilde;ado para conectar varios perif&eacute;ricos a una computadora,
            como discos duros externos, c&aacute;maras digitales, teclados, ratones, entre otros.
            Tienen diferentes velocidades de transferencia de datos,
            desde USB 1.1 hasta USB 3.2 y distintos tipos como USB-C y micro-USB.
        </p>

        <p style="text-align: center; margin-top: 4%;">Ethernet</p>
        <img src="img/Img3-7.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Es una abertura en el equipo de red del ordenador en el que se conectan los
            cables Ethernet. Su prop&oacute;sito es conectar el hardware de red al&aacute;mbrica en una LAN Ethernet, una red de &aacute;rea
            metropolitana (MAN) o una red de &aacute;rea extendida (WAN) o a Internet.
            Tienen diferentes velocidades de transferencia de datos, desde 10 Mbps hasta 100 Gbps.
        </p>

        <p style="text-align: center; margin-top: 4%;">PS/2</p>
        <img src="img/Img3-8.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Fueron de los primeros puertos usados para conectar el mouse y el teclado,
            reemplazados posteriormente por USB.
        </p>

        <p style="text-align: center; margin-top: 4%;">DisplayPort</p>
        <img src="img/Img3-9.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Es una interfaz digital est&aacute;ndar, utilizado para transmitir se&ntilde;ales de audio y
            video de alta calidad entre dispositivos, como pantallas y monitores. Soporta resoluciones de hasta 8K y
            60Hz.
        </p>

        <p style="text-align: center; margin-top: 4%;">Puerto de audio</p>
        <img src="img/Img3-10.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Este puerto es utilizado para conectar altavoces, auriculares, micr&oacute;fonos y otros
            dispositivos de audio.
        </p>

        <p style="text-align: center; margin-top: 4%;">Puerto FireWire</p>
        <img src="img/Img3-11.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">
        <p style="padding-bottom: 5%;">Este puerto es utilizado para conectar dispositivos de alta velocidad, como
            c&aacute;maras de video y discos duros externos. FireWire tambi&eacute;n se conoce como IEEE 1394.
        </p>

        <h5 style="padding-top: 5%;"><em>3.1.4- Controlador de interrupciones</em></h5>
        <p>
            El <b>controlador de interrupciones</b> es un m&oacute;dulo que tiene por funci&oacute;n gestionar las interrupciones de
            entrada/salida para el procesador. Esto ahorra dise&ntilde;ar l&oacute;gica y a&ntilde;adir patitas al procesador. Tambi&eacute;n
            proporciona flexibilidad porque permite idealmente, gestionar un n&uacute;mero ilimitado se&ntilde;ales de interrupci&oacute;n
            (favoreciendo la expansi&oacute;n del sistema de entrada/salida).
        </p>

        <img src="img/Img3-12.png" style="height: 20%; width: 30%; padding-top: 3%;">
        <p style="text-align: center; font-size: 15px; padding-top: 0;">Ejemplo Intel 8259</p>

        <p>
            Est&aacute; compuesto por dos chips: el PIC maestro y el PIC esclavo.
            El PIC maestro es el encargado de recibir las se&ntilde;ales de interrupci&oacute;n y de enviarlas al procesador,
            mientras que el PIC esclavo maneja las interrupciones de los dispositivos perif&eacute;ricos adicionales.
        </p>

        <p>
            La configuraci&oacute;n del controlador de interrupciones se realiza mediante el registro de m&aacute;scara de
            interrupci&oacute;n. Este registro se utiliza para habilitar o deshabilitar las interrupciones de dispositivos
            perif&eacute;ricos espec&iacute;ficos.

        </p>

        <h5 style="padding-top: 5%;"><em>3.1.5- Controlador de Acceso Directo a Memoria (DMA)</em></h5>
        <p>
            Un <b>controlador de acceso directo a memoria</b> es un componente de hardware en
            la arquitectura de computadoras que permite la transferencia de datos entre dispositivos perif&eacute;ricos y la
            memoria principal de la computadora sin la intervenci&oacute;n de la CPU. En lugar de que la CPU maneje cada
            transferencia de datos, el DMA toma el control y administra la transferencia de datos de manera eficiente,
            lo que libera a la CPU para realizar otras tareas.
        </p>

        <img src="img/Img3-13.jpg" style="height: 20%; width: 30%; padding-top: 3%; padding-bottom: 3%;">

        <p>
            Cuando un dispositivo perif&eacute;rico necesita transferir datos a la memoria principal, env&iacute;a una solicitud al
            controlador DMA. El controlador DMA, a su vez, toma el control del bus del sistema y coordina la
            transferencia de datos directamente entre el dispositivo perif&eacute;rico y la memoria principal. Durante la
            transferencia de datos, la CPU se libera de la carga de manejar la transferencia y puede realizar otras
            tareas.
        </p>

        <h5 style="padding-top: 5%;"><em>3.1.6- Circuitos de Temporizaci&oacute;n</em></h5>
        <p>
            Los <b>circuitos de temporizaci&oacute;n</b> se utilizan para controlar la sincronizaci&oacute;n de las operaciones que se
            realizan dentro de un sistema digital. Estos circuitos son responsables de generar se&ntilde;ales de temporizaci&oacute;n
            precisas que permiten que las operaciones de entrada y salida, las transferencias de datos y otras funciones
            se realicen en el momento adecuado.
        </p>

        <p>
            Se encuentra en la placa base de la PC y que es capaz de mantener una cuenta de tiempo basada en el reloj de
            la computadora. Puede usarse para calcular el intervalo entre dos mediciones de tiempo o para generar
            pausas. Este chip tiene la capacidad de realizar diferentes funciones de conteo. Es &uacute;til para medir el
            tiempo que dura cierto proceso o para mantener actualizadas la hora del d&iacute;a y la fecha si se deja la PC
            conectada y encendida.
        </p>


        <h5 style="padding-top: 5%;"><em>3.1.7- Circuitos de Control</em></h5>
        <p>
            Los <b>circuitos de control</b> en un chipset son aquellos componentes electr&oacute;nicos que se encargan de
            gestionar el
            flujo de datos y controlar el comportamiento de los diferentes dispositivos conectados a la placa madre.
        </p>

        <img src="img/Img3-14.png" style="height: 20%; width: 30%; padding-top: 3%;">
        <p style="text-align: center; font-size: 15px; padding-top: 0;">Ejemplo de circuitos de control
            de un ventilador o cooler.</p>

        <p>
            Son responsables de controlar y coordinar el flujo de datos entre el procesador, la memoria y otros
            dispositivos de hardware conectados a la placa madre, permitiendo que los dispositivos trabajen juntos de
            manera eficiente y efectiva.
        </p>

        <h5 style="padding-top: 5%;"><em>3.1.8- Controladores de Video</em></h5>
        <p>
            Los controladores de video son componentes esenciales en cualquier dispositivo que tenga una pantalla. Se
            encargan de enviar la informaci&oacute;n gr&aacute;fica desde el procesador a la pantalla, asegurando que las im&aacute;genes se
            muestren correctamente y sin interrupciones, existen dos tipos principales:
        </p>
        <ul style="margin-left: 3%; padding-bottom: 5%;">
            <li style="padding-top: 2%;"><strong>Integrados</strong>:
                se encuentran dentro del procesador y comparten la memoria RAM con otros componentes del sistema. Son
                adecuados para tareas b&aacute;sicas como navegaci&oacute;n web y edici&oacute;n de documentos, pero no son lo
                suficientemente potentes para juegos o aplicaciones gr&aacute;ficas intensivas.
            </li>

            <img src="img/Img3-15.png" style="height: 20%; width: 30%; padding-top: 3%;">

            <li style="padding-top: 2%;"><strong>Dedicados</strong>:
                tienen su propia memoria y procesador, lo que les permite manejar gr&aacute;ficos complejos sin afectar el
                rendimiento general del sistema. Son ideales para juegos, dise&ntilde;o gr&aacute;fico y edici&oacute;n de video, pero pueden
                ser costosos y consumir mucha energ&iacute;a.
            </li>
        </ul>

        <hr color="red" size="10px" />
        <h4 style="padding-top: 2%; padding-bottom: 2%;"><em>3.2.- Aplicaciones</em></h4>
        <hr color="red" size="10px" />

        <p style="padding-top: 5%;">
            El chipset es el centro de comunicaciones de la placa base de un ordenador, controla y organiza los datos
            entre el procesador y el resto de los componentes, como los discos duros, los discos SSD, la memoria RAM,
            las tarjetas gr&aacute;ficas, los puertos USB, el monitor, el teclado o el rat&oacute;n. El chipset es el encargado de
            controlar el tr&aacute;fico de estos datos, o el centro de operaciones donde todos estos datos se organizan.
        </p>


        <h5 style="padding-top: 5%;"><em>3.2.1- Entrada/Salida</em></h5>
        <p>Un <b>perif&eacute;rico de entrada/salida</b> es un tipo de dispositivo perif&eacute;rico de un computador
            capaz de interactuar con los elementos externos a ese sistema de forma bidireccional,
            es decir, que permite tanto que sea ingresada informaci&oacute;n desde un sistema externo,
            como emitir informaci&oacute;n a partir de ese sistema.
        </p>

        <img src="img/Img3-16.png" style="height: 40%; width: 50%; padding-top: 5%; padding-bottom: 3%;">

        <p>
            Son todos los dispositivos que permiten
            introducir datos o informaci&oacute;n en una computadora para que esta los procese u ordene.
        </p>

        <h5 style="padding-top: 5%;"><em>3.2.2- Almacenamiento</em></h5>

        <p>
            el almacenamiento es el componente que permite almacenar y acceder a datos a largo plazo.
            Usualmente, el almacenamiento se da en forma de una unidad de estado s&oacute;lido o un disco duro.
            El almacenamiento le permite acceder y almacenar sus aplicaciones, sistema operativo y archivos
            por un tiempo indefinido, los tipos de almacenamiento mas comunes son:
        </p>

        <ul style="margin-left: 3%; padding-bottom: 5%; padding-top: 3%;">
            <li><b>HDD (Hard-Disk Drive)</b>: discos magnetizados, de bajo costo y gran almacenamiento. Cada vez que
                se realiza un cambio el cabezal del disco duro ajusta el magnetismo del disco seg&uacute;n corresponda. </li>

            <img src="img/Img3-17.png" style="height: 15%; width: 25%; padding-top: 5%; padding-bottom: 3%;">

            <li><b>SSD (Solid State Drive)</b>: semiconductores que almacenan datos mediante la alteraci&oacute;n del estado
                el&eacute;ctrico de los circuitos contenidos.</li>

            <img src="img/Img3-18.png" style="height: 20%; width: 30%; padding-top: 5%;">
        </ul>

        <p>
            Las SSD son m&aacute;s costosas de fabricar, por lo que, si bien son cada vez m&aacute;s la opci&oacute;n predilecta como
            unidad de disco primario, muchos a&uacute;n prefieren las unidades de HDD debido a que son una opci&oacute;n
            m&aacute;s econ&oacute;mica.
        </p>

        <h5 style="padding-top: 5%;"><em>3.2.3- Fuentes de Alimentaci&oacute;n</em></h5>
        <p>
            Las fuentes de alimentaci&oacute;n son componentes esenciales en cualquier computadora, ya que proporcionan la
            energ&iacute;a necesaria para que el sistema funcione adecuadamente, convierten la corriente alterna (AC)
            en corriente continua (DC) para suministrar energ&iacute;a a los componentes de la computadora.
        </p>

        <img src="img/Img3-19.png" style="height: 20%; width: 30%; padding-top: 5%;">

        <p style="padding-bottom: 5%;">
            Existen fuentes de alimentaci&oacute;n que no requieren de ventilaci&oacute;n, por lo que su refrigeraci&oacute;n es
            completamente pasiva. Estos modelos suelen ser fuentes de medio-bajo voltaje con una alta eficiencia, para
            que el calor generado sea menor y se pueda llevar a cabo su disipaci&oacute;n sin usar ni un solo ventilador
            acoplado a la fuente, con los que existan en la caja ser&aacute;n m&aacute;s que suficiente.
        </p>


        <hr color="red" size="10px" />
        <h4 style="padding-top: 2%; padding-bottom: 2%;">
            <em>3.3.- Ambientes de Servicio</em>
        </h4>
        <hr color="red" size="10px" />

        <p style="padding-top: 5%;">
            Los <b>ambientes de servicios</b> son los distintos entornos que son
            necesarios para el correcto funcionamiento de un sistema inform&aacute;tico.
            Estos ambientes pueden incluir tanto hardware como software,
            y son fundamentales para garantizar que los dispositivos electr&oacute;nicos puedan
            interactuar adecuadamente con los usuarios y con otros sistemas.
        </p>

        <h5 style="padding-top: 5%;"><em>3.3.1- Negocios</em></h5>
        <p>
            Al armar un equipo de c&oacute;mputo para negocios, es importante seleccionar los componentes adecuados para
            maximizar su rendimiento, eficiencia y durabilidad. Se deben tener en cuenta factores como
            el tipo de uso que se le dar&aacute; al equipo, la cantidad de usuarios que lo utilizar&aacute;n,
            el presupuesto disponible y las necesidades espec&iacute;ficas de la empresa.
        </p>

        <p>
            Los negocios suelen tener altas demandas de procesamiento y almacenamiento de datos debido a la cantidad de
            informaci&oacute;n que manejan diariamente. Por esta raz&oacute;n, es necesario seleccionar componentes que sean capaces
            de manejar grandes cantidades de informaci&oacute;n de manera eficiente, algunos factores a consideras son:
        </p>

        <ul style="margin-left: 3%;">
            <li style="padding-top: 2%;"><b>Procesador</b>:
                Para un equipo de negocios, se recomienda un procesador de gama media o alta,
                como Intel Core i5 o i7, o AMD Ryzen 5 o 7.
            </li>

            <li style="padding-top: 2%;"><b>Memoria RAM</b>:
                Para un equipo de negocios, se recomienda una cantidad m&iacute;nima de 8GB de RAM, aunque lo ideal ser&iacute;a
                contar con 16GB o m&aacute;s.Esto permitir&aacute; que el equipo pueda manejar m&uacute;ltiples aplicaciones y programas al
                mismo tiempo sin sufrir de lentitud o bloqueos.
            </li>

            <li style="padding-top: 2%;"><b>Disco Duro</b>:
                Para un equipo de negocios, se recomienda un disco duro SSD de al menos 256GB, aunque
                lo ideal ser&iacute;a contar con un disco duro de mayor capacidad. Los discos duros SSD ofrecen una mayor
                velocidad de lectura y escritura de datos, lo que se traduce en un mejor rendimiento del equipo. Sin
                embargo, tambi&eacute;n son m&aacute;s costosos que los discos duros HDD.
            </li>

            <li style="padding-top: 2%;"><b>Tarjeta Gr&aacute;fica</b>:
                Para un equipo de negocios, se recomienda una tarjeta gr&aacute;fica de gama media o alta, como NVIDIA GeForce
                GTX o AMD Radeon RX. No todos los equipos de negocios requieren de una tarjeta gr&aacute;fica dedicada,
                por lo que se debe evaluar si es necesario incluirla en la selecci&oacute;n de componentes.
            </li>
        </ul>

        <p>
            Al seguir estas recomendaciones, se puede asegurar que el equipo de c&oacute;mputo
            ser&aacute; una herramienta valiosa para el crecimiento y &eacute;xito de la empresa.
        </p>

        <h5 style="padding-top: 5%;"><em>3.3.2- Industria</em></h5>
        <img src="img/Img3-20.jpg" style="height: 20%; width: 30%; padding-top: 5%;">
        <p>
            Puede haber requisitos espec&iacute;ficos en cuanto al desempe&ntilde;o, capacidad de procesamiento, capacidad de
            almacenamiento y seguridad de la computadora. Por ejemplo, en la industria del dise&ntilde;o gr&aacute;fico y la
            animaci&oacute;n, se requiere una computadora con una tarjeta gr&aacute;fica potente y una gran cantidad de memoria RAM
            para poder trabajar con aplicaciones de alta demanda gr&aacute;fica, en la industria de ingenier&iacute;a
            las computadoras pueden requerir un procesador potente y una gran cantidad de memoria RAM
            para poder manejar grandes conjuntos de datos y realizar c&aacute;lculos complejos.
        </p>

        <h5 style="padding-top: 5%;"><em>3.3.3- Comercio electr&oacute;nico</em></h5>
        <p>
            El <b>comercio electr&oacute;nico</b> es la compra y venta de bienes o servicios a trav&eacute;s de Internet. Esto implica
            la
            interacci&oacute;n entre los clientes y los proveedores a trav&eacute;s de servicios de internet.
            Las plataformas de comercio electr&oacute;nico requieren sistemas de hardware y software que sean confiables,
            escalables y seguros. Esto incluye servidores web, bases de datos, redes de computadoras y sistemas de
            seguridad.
        </p>
        <img src="img/Img3-21.png" style="height: 20%; width: 30%; padding-top: 5%;">
        <p>
            Los microservicios se utilizan para construir aplicaciones flexibles y adaptables a medida que cambian las
            necesidades del negocio. De esta forma, nos ahorramos la necesidad de invertir miles o cientos de miles de
            dol&aacute;res en comprar servidores, almacenamiento y mucho m&aacute;s.<br><br>

            Los m&aacute;s usados son el SAAS (Software As a Service), donde los proveedores proporcionan el hardware y el
            software para llevar a cabo la logica del negocio, mantenimiento y la implementaci&oacute;n de tecnolog&iacute;as, es
            decir, ellos se encargan del software y arquitectura de computadoras.<br><br>

            De esta forma se puede implementar tecnolog&iacute;as necesarias para el comercio electr&oacute;nico, como la
            realizaci&oacute;n y verificaci&oacute;n de pagos, gesti&oacute;n de inventario, etc.

        </p>

    </div>

    <footer>
        Copyright &copy; 2023 || Erik Daniel Rodr&iacute;guez Garc&iacute;a
    </footer>
</body>

</html>